Added signin/signup page and fixed jobs filtering processing
